index.org
#+title: Speisekarte
#+author: HaskellHegemonie
#+email: haskellisierer@proton.me
#+date: 2024-01-24
#+setupfile: org-html-themes/org/theme-readtheorg-local.setup
#+HTML_MATHJAX: align: left indent: 5em tagside: left
#+options: \n:t
#+options: tex:dvipng toc:t num:t
* Das Virus ist der Teufel
*und ist im Oasch daham*
* Hausgemachte Spezialitäten
** Stand for ze Emacs and kneel before ze Stallman
- [[https://github.com/HaskellHegemonie/emacs-brotherhood][praise thee o emacs]]
** Simon's toy
- [[https://github.com/HaskellHegemonie/haskell-pride][pride flag]]
** Nix
* Worth reading
- anti-javascript [[https://www.gnu.org/philosophy/javascript-trap.html][doctrine]] #freejavascript
- [[https://www.stallman.org/][legend]]
- [[https://www.churchofemacs.org/][cleaning]]
* LaTeX/Unicode addiction?
- =C-x RET C-\=
- =C-\=
- [[https://agda.readthedocs.io/en/latest/tools/emacs-mode.html][Agda input method]]
- =C-x 8 RET=
- =C-x 8 e s=

* Cringey
**  [[https://www.reddit.com/user/JustAnotherShyFembo/][JavaHuso]]
1. [[https://www.youtube.com/watch?v=xomvsjKfMAw][ShavingForSaving]]
2. [[https://www.youtube.com/watch?v=nAmLc627z60][JanPropaganda]]
** [[https://jiundji.github.io][young chinese boy]]
1. [[https://www.youtube.com/watch?v=jw_mocdk9tE&t=14s][荣耀归于中共]]
2. [[https://www.youtube.com/watch?v=5tCMI0uKbBE][Ji Livestream]]
**  [[https://www.codingame.com/profile/45bbdc919d57dd6b3c704cd7b1e7d1306212995/followers][Yappoccino]]
** [[https://werteunion.de/werteunion-partei/][union]]
A union (or coproduct if you're a chad) is a datastructure with one or more injective functions.
It consists of one or more fields that have their corresponding constructor to /inject/ into the datastructure.
If you are given a union as an input you have to pattern match and return the result accordingly.

* Org Mode, LaTeX and HTLM
* Emacs

****There is no system but GNU, and Linux is one of its kernels.****
