index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-05 Fri 15:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Speisekarte</title>
<meta name="author" content="HaskellHegemonie" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Speisekarte</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcd8aa01">1. Das Virus ist der Teufel</a></li>
<li><a href="#org140898d">2. Hausgemachte Spezialitäten</a>
<ul>
<li><a href="#org5e8688d">2.1. Stand for ze Emacs and kneel before ze Stallman</a></li>
<li><a href="#org89a4471">2.2. Simon's toy</a></li>
<li><a href="#orgd74dd46">2.3. Nix</a></li>
</ul>
</li>
<li><a href="#org61536a1">3. Worth reading</a></li>
<li><a href="#orgf51d92e">4. LaTeX/Unicode addiction?</a></li>
<li><a href="#org579805b">5. Cringey</a>
<ul>
<li><a href="#org967a3fc">5.1. JavaHuso</a></li>
<li><a href="#org127abad">5.2. young chinese boy</a></li>
<li><a href="#orgd56375a">5.3. Yappoccino</a></li>
<li><a href="#org579481c">5.4. union</a></li>
</ul>
</li>
<li><a href="#orgf3bacf5">6. Org Mode, LaTeX and HTLM</a></li>
<li><a href="#org9151bd6">7. Emacs</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcd8aa01" class="outline-2">
<h2 id="orgcd8aa01"><span class="section-number-2">1.</span> Das Virus ist der Teufel</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>und ist im Oasch daham</b><br />
</p>
</div>
</div>
<div id="outline-container-org140898d" class="outline-2">
<h2 id="org140898d"><span class="section-number-2">2.</span> Hausgemachte Spezialitäten</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5e8688d" class="outline-3">
<h3 id="org5e8688d"><span class="section-number-3">2.1.</span> Stand for ze Emacs and kneel before ze Stallman</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://github.com/HaskellHegemonie/emacs-brotherhood">praise thee o emacs</a><br /></li>
</ul>
</div>
</div>
<div id="outline-container-org89a4471" class="outline-3">
<h3 id="org89a4471"><span class="section-number-3">2.2.</span> Simon's toy</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://github.com/HaskellHegemonie/haskell-pride">pride flag</a><br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgd74dd46" class="outline-3">
<h3 id="orgd74dd46"><span class="section-number-3">2.3.</span> Nix</h3>
</div>
</div>
<div id="outline-container-org61536a1" class="outline-2">
<h2 id="org61536a1"><span class="section-number-2">3.</span> Worth reading</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>anti-javascript <a href="https://www.gnu.org/philosophy/javascript-trap.html">doctrine</a> #freejavascript<br /></li>
<li><a href="https://www.stallman.org/">legend</a><br /></li>
<li><a href="https://www.churchofemacs.org/">cleaning</a><br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgf51d92e" class="outline-2">
<h2 id="orgf51d92e"><span class="section-number-2">4.</span> LaTeX/Unicode addiction?</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><code>C-x RET C-\</code><br /></li>
<li><code>C-\</code><br /></li>
<li><a href="https://agda.readthedocs.io/en/latest/tools/emacs-mode.html">Agda input method</a><br /></li>
<li><code>C-x 8 RET</code><br /></li>
<li><code>C-x 8 e s</code><br /></li>
</ul>
</div>
</div>

<div id="outline-container-org579805b" class="outline-2">
<h2 id="org579805b"><span class="section-number-2">5.</span> Cringey</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org967a3fc" class="outline-3">
<h3 id="org967a3fc"><span class="section-number-3">5.1.</span> <a href="https://www.reddit.com/user/JustAnotherShyFembo/">JavaHuso</a></h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=xomvsjKfMAw">ShavingForSaving</a><br /></li>
<li><a href="https://www.youtube.com/watch?v=nAmLc627z60">JanPropaganda</a><br /></li>
</ol>
</div>
</div>
<div id="outline-container-org127abad" class="outline-3">
<h3 id="org127abad"><span class="section-number-3">5.2.</span> <a href="https://jiundji.github.io">young chinese boy</a></h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=jw_mocdk9tE&amp;t=14s">荣耀归于中共</a><br /></li>
<li><a href="https://www.youtube.com/watch?v=5tCMI0uKbBE">Ji Livestream</a><br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgd56375a" class="outline-3">
<h3 id="orgd56375a"><span class="section-number-3">5.3.</span> <a href="https://www.codingame.com/profile/45bbdc919d57dd6b3c704cd7b1e7d1306212995/followers">Yappoccino</a></h3>
</div>
<div id="outline-container-org579481c" class="outline-3">
<h3 id="org579481c"><span class="section-number-3">5.4.</span> <a href="https://werteunion.de/werteunion-partei/">union</a></h3>
<div class="outline-text-3" id="text-5-4">
<p>
A union (or coproduct if you're a chad) is a datastructure with one or more injective functions.<br />
It consists of one or more fields that have their corresponding constructor to <i>inject</i> into the datastructure.<br />
If you are given a union as an input you have to pattern match and return the result accordingly.<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgf3bacf5" class="outline-2">
<h2 id="orgf3bacf5"><span class="section-number-2">6.</span> Org Mode, LaTeX and HTLM</h2>
</div>
<div id="outline-container-org9151bd6" class="outline-2">
<h2 id="org9151bd6"><span class="section-number-2">7.</span> Emacs</h2>
<div class="outline-text-2" id="text-7">
<p>
<b><b><b><b>There is no system but GNU, and Linux is one of its kernels.</b></b></b></b><br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-24</p>
<p class="author">Author: HaskellHegemonie</p>
<p class="date">Created: 2024-07-05 Fri 15:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
